Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/cohabiting_couples/inheritance_rights_and_unmarried_couples.html.txt.tmx
Source language: en
Languages: ga

source: Inheritance rights of cohabiting couples
ga: Cearta oidhreachta agus lánúineacha comhchónaithe

source: If you are at least 18 years old and of sound mind, you may make a will
ga: Má tá tú ar a laghad 18 mbliana d’aois agus slánmheabhrach, is féidir leat uacht a dhéanamh

source: If you later get married or enter a civil partnership, that will is automatically cancelled
ga: Má phósann tú nó má iontrálann tú páirtnéireacht shibhialta níos déanaí, cealófar an uacht sin go huathoibríoch

source: However, if you do not get married, or enter a civil partnership, and enter into cohabitation (i.e., move in with a partner), it has no effect on your pre-existing will
ga: Mura bpósann tú nó mura n-iontrálann tú páirtnéireacht shibhialta, agus má iontrálann tú caidreamh comhchónaithe (i.e. bogann tú isteach le páirtnéir), ní bheidh aon tionchar aige ar an uacht atá ann cheana féin

source: If you are married or in a civil partnership, the Succession Act 1965 gives your surviving spouse/civil partner a legal right to a share of your estate when you die, no matter what you have said or specified in your will
ga: Má tá tú pósta nó i bpáirtnéireacht shibhialta, tugtar san Acht Comharbais, 1965 ceart dlíthiúil do do chéile/pháirtnéir sibhialta marthanach chun sciar de d’eastát a fháil nuair a fhaigheann tú bás, gan aird ar a ndeirtear nó a shonraítear i d’uacht

source: This does not apply to cohabiting couples
ga: Ní bhaineann é seo le lánúineacha comhchónaithe

source: In other words, if you are in a cohabiting relationship, there is nothing to prevent you from leaving some or all of your property to your partner in your will
ga: I bhfriotal eile, má tá tú i gcaidreamh comhchónaithe, níl cosc ar bith ort cuid de do mhaoin nó do mhaoin go léir a fhágáil le do pháirtnéir i d’uacht

source: However, if you are or have been married or in a civil partnership, your spouse/civil partner may be legally entitled to a share of your estate even though you are now separated from him/her
ga: Má tá tú nó má bhí tú pósta nó i bpáirtnéireacht shibhialta, áfach, b'fhéidir go bhfuil do chéile/pháirtnéir sibhialta go dlíthiúil i dteideal sciar de d’eastát a fháil cé go bhfuil tú scartha uaidh/uaithi anois

source: If you are in a cohabiting relationship and you die without a will, your partner has no right to any share of the estate no matter how long you have been together, apart from what was held jointly
ga: Má tá tú i gcaidreamh comhchónaithe agus má fhaigheann tú bás gan uacht a dhéanamh, níl aon cheart ag do chéile aon sciar den eastát a fháil, is cuma cé chomh fada a bhí sibh le chéile, seachas é sin a bhí faoi chomhúinéireacht

source: Many people are not aware of this, so it is very important to know your rights in this situation
ga: Níl go leor daoine ar an eolas faoi seo, mar sin, tá sé an-tábhachtach gur fios duit do chuid cearta sa chás seo

source: Under the redress scheme for cohabiting couples a qualified cohabitant may apply for provision to be made from the estate of a deceased cohabitant
ga: Faoin scéim um shásamh le haghaidh lánúineacha comhchónaithe, féadfaidh comhchónaitheoir cáilithe iarratas a dhéanamh go ndéanfar soláthar dóibh ó eastát comhchónaitheora mhairbh

source: Where the partner dies in an existing relationship, it is not necessary to show financial dependence
ga: Sa chás go bhfaigheann an páirtnéir bás i gcaidreamh reatha, ní gá spleáchas airgeadais a léiriú

source: The natural children of parents who are born inside or outside marriage and adopted children have the same inheritance rights
ga: Tá ag leanaí nádúrtha tuismitheoirí a rugadh laistigh nó lasmuigh den phósadh agus ag leanaí uchtaithe na cearta comhionanna oidhreachta

source: In the case of a cohabiting couple where the surviving partner inherits the family home, the surviving partner may be liable for inheritance tax, unless the surviving partner qualifies for dwelling house tax exemption
ga: I gcás lánúin chomhchónaithe, ina bhfaigheann an páirtnéir marthanach teach an teaghlaigh le hoidhreacht, b’fhéidir go mbeidh an páirtnéir marthanach faoi dhliteanas íoc as cáin oidhreachta, mura gcáilítear an páirtnéir marthanach le haghaidh díolúine chánach teach cónaithe

source: There is more information on inheritance rights in the document on what happens the deceased's estate
ga: Is ann do níos mó faisnéise faoi chearta oidhreachta sa cháipeis ‘Céard a tharlaíonn d’eastát an mhairbh’

source: Making a will can ensure that proper arrangements are made for your dependants and that your property is distributed in the way you wish after you die, subject to certain rights of spouses/civil partners and children
ga: Is féidir le huacht a dhéanamh a chinntiú go ndéantar na socruithe cuí do do chuid cleithiúnaithe agus go ndéantar do réadmhaoin a leithdháileadh ar an mbealach is mian leat i ndiaidh duit bás a fháil, faoi réir cearta áirithe céilí/páirtnéirí sibhialta agus leanaí

source: A solicitor can help you draft a will or you can draft one yourself
ga: Féadfaidh aturnae cabhrú leat uacht a dhréachtú nó féadfaidh tú ceann a dhréachtú tú féin

source: Contact information for solicitors firms throughout Ireland is available on the Law Society website
ga: Tá fáil ar Shonraí teagmhála le haghaidh gnólachtaí aturnaetha ar fud na hÉireann ar láithreán gréasáin Dhlí-Chumann na hÉireann

source: FLAC (Free Legal Advice Centres) is an independent, voluntary organisation that operates a network of legal advice clinics throughout the country
ga: Eagraíocht neamhspleách, dheonach iad ICDSanna (Ionaid Chomhairle Dlí Saor in Aisce) ag a bhfuil líonra clinicí comhairle á oibriú ar fud na tíre

source: These clinics are confidential, free of charge and open to all
ga: Tá na clinicí seo faoi rún, saor in aisce agus oscailte do chách

source: Contact your nearest Citizens Information Centre for information on FLAC services in your area
ga: Déan teagmháil le d'Ionad um Fhaisnéis do Shaoránaigh is gaire duit chun teacht ar fhaisnéis ar sheirbhísí ICDS i do cheantar

source: FLAC also runs an information and referral line during office hours for basic legal information
ga: Tá líne ghutháin faisnéise agus atreoraithe á reáchtáil ag ICDS le linn uaireanta oifige le haghaidh faisnéis bhunúsach dlí

source: FLAC has produced a series of basic leaflets on various areas of law which may be useful
ga: Chuir ICDS sraith bileoga bunúsacha i dtoll a chéile ar limistéir éagsúla an dlí a d'fhéadfadh bheith áisiúil

source: These are available from your local Citizens Information Centre and from FLAC or can be downloaded from the FLAC website
ga: Tá fáil orthu seo ó d’Ionad um Fhaisnéis do Shaoránaigh agus ICDS nó féadtar iad a íoslódáil ó ICDS
